## Уровень 1: Базовые упражнения

### Упражнение 1.1: Вывод информации

**Сложность:** ⭐

Напишите программу, которая выводит следующую информацию в формате таблицы:

- Ваше имя
- Ваш возраст
- Ваш рост (в см)
- Ваш вес (в кг)

**Ожидаемый результат:**

```
Имя: Иван
Возраст: 25
Рост: 180
Вес: 75
```

---

### Упражнение 1.2: Простые вычисления

**Сложность:** ⭐

Напишите программу, которая:

1. Считывает три целых числа
2. Вычисляет их сумму, среднее арифметическое, произведение
3. Выводит результаты

---

### Упражнение 1.3: Площадь фигур

**Сложность:** ⭐⭐

Напишите программу для вычисления:

- Площади круга (по радиусу)
- Площади прямоугольника (по двум сторонам)
- Площади треугольника (по основанию и высоте)

Используйте константу `PI = 3.14159`

---

## Уровень 2: Условные операторы

### Упражнение 2.1: Определение дня недели

**Сложность:** ⭐⭐

Напишите программу, которая:

- Считывает число от 1 до 7
- Выводит соответствующий день недели

Используйте оператор `switch`

**Пример:**

```
Введите число (1-7): 3
Среда
```

---

### Упражнение 2.2: Сортировка трёх чисел

**Сложность:** ⭐⭐

Прочитав три числа, отсортируйте их в порядке возрастания и выведите.

**Пример:**

```
Введите три числа: 15 3 42
Отсортировано: 3 15 42
```

---

### Упражнение 2.3: Проверка треугольника

**Сложность:** ⭐⭐⭐

Напишите программу, которая проверяет:

- Существует ли треугольник с данными сторонами (сумма двух сторон должна быть больше третьей)
- Является ли треугольник прямоугольным (проверка теоремы Пифагора)
- Является ли треугольник равносторонним, равнобедренным или разносторонним

---

## Уровень 3: Циклы

### Упражнение 3.1: Сумма чётных чисел

**Сложность:** ⭐⭐

Напишите программу для нахождения суммы всех чётных чисел от 1 до n.

**Пример:**

```
Введите n: 10
Сумма чётных чисел: 30 (2 + 4 + 6 + 8 + 10)
```

---

### Упражнение 3.2: Таблица квадратов

**Сложность:** ⭐⭐

Выведите таблицу квадратов чисел от 1 до 10:

```
Число | Квадрат
------|--------
  1   |    1
  2   |    4
  3   |    9
...
 10   |   100
```

---

### Упражнение 3.3: Число Армстронга

**Сложность:** ⭐⭐⭐

Проверьте, является ли число Армстронга (число, равное сумме своих цифр, возведённых в степень, равную количеству цифр).

**Примеры:**

- 153 = 1³ + 5³ + 3³ (является)
- 370 = 3³ + 7³ + 0³ (является)
- 100 (не является)

---

### Упражнение 3.4: Треугольник Паскаля

**Сложность:** ⭐⭐⭐

Выведите треугольник Паскаля до n строк:

```
Введите количество строк: 5
    1
   1 1
  1 2 1
 1 3 3 1
1 4 6 4 1
```

---

## Уровень 4: Функции и модульность

### Упражнение 4.1: Калькулятор НОД

**Сложность:** ⭐⭐

Напишите функцию для нахождения:

- НОД (наибольший общий делитель) двух чисел
- НОК (наименьшее общее кратное) двух чисел

Используйте алгоритм Евклида для НОД.

---

### Упражнение 4.2: Проверка палиндрома

**Сложность:** ⭐⭐⭐

Напишите программу, которая проверяет, является ли число палиндромом (читается одинаково в обе стороны).

**Примеры:**

```
121 — палиндром
12321 — палиндром
123 — не палиндром
```

---

### Упражнение 4.3: Генератор чисел Фибоначчи

**Сложность:** ⭐⭐⭐

Напишите функцию для вычисления n-го числа Фибоначчи двумя способами:

1. Итеративный метод
2. Рекурсивный метод (с учётом производительности)

**Последовательность:** 1, 1, 2, 3, 5, 8, 13, 21...

---

## Уровень 5: Комплексные задачи

### Упражнение 5.1: Калькулятор

**Сложность:** ⭐⭐⭐⭐

Напишите простой калькулятор, который:

- Считывает два числа и операцию (+, -, \*, /)
- Выполняет операцию
- Обрабатывает случаи деления на ноль

**Расширение:** Добавьте операции возведения в степень (^) и модуля (%)

---

### Упражнение 5.2: Угадай число

**Сложность:** ⭐⭐⭐⭐

Создайте игру "Угадай число", где:

- Компьютер загадывает случайное число от 1 до 100
- Пользователь пытается его угадать
- После каждой попытки выводится подсказка ("больше", "меньше")
- В конце выводится количество попыток

Подсказка: используйте `#include <cstdlib>` и `rand()` для случайного числа.

---

### Упражнение 5.3: Матрица

**Сложность:** ⭐⭐⭐⭐⭐

Напишите программу для работы с матрицей 3×3:

- Считывание матрицы
- Вывод матрицы
- Вычисление суммы элементов
- Поиск максимального элемента
- Вычисление суммы диагонали

---

## Решения (Примеры)

### Решение 1.1: Вывод информации

```cpp
#include <iostream>
#include <string>
using namespace std;

int main() {
    string name;
    int age, height, weight;

    cout << "Введите имя: ";
    cin >> name;

    cout << "Введите возраст: ";
    cin >> age;

    cout << "Введите рост (см): ";
    cin >> height;

    cout << "Введите вес (кг): ";
    cin >> weight;

    cout << "\n--- Информация ---" << endl;
    cout << "Имя: " << name << endl;
    cout << "Возраст: " << age << endl;
    cout << "Рост: " << height << endl;
    cout << "Вес: " << weight << endl;

    return 0;
}
```

---

### Решение 3.1: Сумма чётных чисел

```cpp
#include <iostream>
using namespace std;

int main() {
    int n;
    int sum = 0;

    cout << "Введите n: ";
    cin >> n;

    for (int i = 2; i <= n; i += 2) {
        sum += i;
    }

    cout << "Сумма чётных чисел от 1 до " << n << ": " << sum << endl;

    return 0;
}
```

---

### Решение 4.1: НОД

```cpp
#include <iostream>
using namespace std;

int gcd(int a, int b) {
    while (b != 0) {
        int temp = b;
        b = a % b;
        a = temp;
    }
    return a;
}

int lcm(int a, int b) {
    return (a * b) / gcd(a, b);
}

int main() {
    int x, y;

    cout << "Введите два числа: ";
    cin >> x >> y;

    cout << "НОД(" << x << ", " << y << ") = " << gcd(x, y) << endl;
    cout << "НОК(" << x << ", " << y << ") = " << lcm(x, y) << endl;

    return 0;
}
```

---

### Решение 4.3: Числа Фибоначчи

```cpp
#include <iostream>
using namespace std;

// Итеративный метод
int fibonacciIterative(int n) {
    if (n <= 1) return n;

    int a = 0, b = 1, result;
    for (int i = 2; i <= n; i++) {
        result = a + b;
        a = b;
        b = result;
    }
    return result;
}

// Рекурсивный метод (менее эффективно)
int fibonacciRecursive(int n) {
    if (n <= 1) return n;
    return fibonacciRecursive(n - 1) + fibonacciRecursive(n - 2);
}

int main() {
    int n;

    cout << "Введите n: ";
    cin >> n;

    cout << "Число Фибоначчи (итеративно): " << fibonacciIterative(n) << endl;

    // Для больших n не рекомендуется использовать рекурсию
    if (n <= 35) {
        cout << "Число Фибоначчи (рекурсивно): " << fibonacciRecursive(n) << endl;
    }

    return 0;
}
```
